<?php
/**
 * mysqli数据库操作异常接口
 *
 * @package		comnide
 * @author			B.I.T
 * @copyright		Copyright (c) 2016 - 2017.
 * @license
 * @link
 * @since				Version 1.17
 */

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------
 * 继承自CO_DB_Exception基类
* 扩展实现mysqli数据库的相应接口
* ------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
class CO_DB_mysqli_exception extends CO_DB_Exception{
	
}